tap "aws/tap"
tap "buo/cask-upgrade"
tap "dagger/tap"
tap "domt4/autoupdate"
tap "fabianishere/personal"
tap "go-task/tap"
tap "hashicorp/tap"
tap "homebrew/autoupdate"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jmespath/jmespath"
tap "localstack/tap"
tap "mike-engel/jwt-cli"
tap "minamijoyo/hcledit"
tap "minamijoyo/tfupdate"
tap "mtslzr/marmaduke-chromium"
tap "turbot/tap"
tap "tylerbrock/saw"
# Run your GitHub Actions locally
brew "act"
# C parser in Python
brew "pycparser"
# C Foreign Function Interface for Python
brew "cffi"
# Cryptographic recipes and primitives for Python
brew "cryptography"
# General-purpose data compression with high compression ratio
brew "xz"
# Automate deployment, configuration, and upgrading
brew "ansible"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Freely available high-quality data compressor
brew "bzip2"
# Next generation open source RPC library and framework
brew "grpc"
# Columnar in-memory analytics layer designed to accelerate big data
brew "apache-arrow"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk", link: false
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli", link: false
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Programmable completion for Bash 3.2
brew "bash-completion"
# C library implementing the SSH2 protocol
brew "libssh2"
{{ if eq .enable.bat true -}}
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
{{ end -}}
# OpenType text shaping engine
brew "harfbuzz"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# GNU binary tools for native development
brew "binutils"
# Bit is a modern Git CLI
brew "bit-git"
# Collection of portable C++ source libraries
brew "boost"
{{ if eq .enable.broot true -}}
# New way to see and navigate directory trees
brew "broot"
{{ end -}}
# GNU File, Shell, and Text utilities
brew "coreutils"
# Library to load and enumerate PKCS#11 modules
brew "p11-kit"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Emacs dependency management
brew "cask"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Generic library support script
brew "libtool"
# Library for encoding and decoding .avif files
brew "libavif"
# Graphics library to dynamically manipulate images
brew "gd"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Utility that creates projects from templates
brew "cookiecutter"
# Easy Rust and C/C++ Integration
brew "corrosion"
# Common UNIX Printing System
brew "cups"
# JSON, YAML, TOML, XML, and CSV query and modification tool
brew "dasel"
# DDC monitor controls (brightness) for Mac OSX command-line
brew "ddcctl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# File comparison utilities
brew "diffutils"
# Tool for exploring each layer in a docker image
brew "dive"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Text processing system for reStructuredText
brew "docutils"
# Classic UNIX line editor
brew "ed"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Modern, maintained replacement for ls
brew "eza"
# High quality MPEG Audio Layer III (MP3) encoder
brew "lame"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Blu-Ray disc playback library for media players like VLC
brew "libbluray"
# Framework for layout and rendering of i18n text
brew "pango"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl2"
# Secure Reliable Transport
brew "srt"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# H.264/AVC encoder
brew "x264"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU awk utility
brew "gawk"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Simple and efficient way to access statistics in git
brew "git-quick-stats"
# Run gitlab pipelines locally as shell executor or docker executor
brew "gitlab-ci-local"
# OpenGL Extension Wrangler Library
brew "glew"
# C++ mathematics library for graphics software
brew "glm"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# X.509 and CMS library
brew "libksba"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Manage compile and link flags for libraries
brew "pkg-config"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Library for loading images as SDL surfaces and textures
brew "sdl2_image"
# Version Control Visualization Tool
brew "gource"
# Library access to GnuPG
brew "gpgme"
# Image manipulation
brew "netpbm"
# GNU triangulated surface library
brew "gts"
# Library to render SVG files using Cairo
brew "librsvg"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Popular GNU data compression program
brew "gzip"
# File format designed to store large amounts of data
brew "hdf5"
# Improved top (interactive process viewer)
brew "htop"
# Cost estimates for Terraform
brew "infracost"
{{ if eq .enable.jenv true -}}
# Manage your Java environment
brew "jenv"
{{ end -}}
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# DNS library written in C
brew "ldns"
# Cloud credentials manager cli
brew "leapp-cli"
# Audio and video processing tools
brew "libav"
# Framework for scientific data networking
brew "libdap"
# Provides library functionality for FIDO U2F & FIDO 2.0, including USB
brew "libfido2"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# General purpose TCP-IP emulator
brew "libslirp"
# Utility for directing compilation
brew "make"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Show markdown documents on text terminals
brew "mdcat"
# Scalable distributed version control system
brew "mercurial"
# Tail multiple files in one terminal simultaneously
brew "multitail"
# Interactive cheatsheet tool for the command-line
brew "navi"
# Libraries and data formats for array-oriented scientific data
brew "netcdf"
# HTTP/2 C Library
brew "nghttp2"
# Port scanning utility for large networks
brew "nmap"
# Optimized BLAS library
brew "openblas"
# Development kit for the Java programming language
brew "openjdk@11"
# Development kit for the Java programming language
brew "openjdk@8"
# OpenBSD freely-licensed SSH connectivity tools
brew "openssh"
# Perl compatible regular expressions library
brew "pcre"
# Port of pdftk in java
brew "pdftk-java"
# Highly capable, feature-rich programming language
brew "perl"
# Draw UML diagrams
brew "plantuml"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Cartographic Projections Library
brew "proj"
# Python version management
brew "pyenv"
# Pyenv plugin to manage virtualenv
brew "pyenv-virtualenv"
# Python implementation of Markdown
brew "python-markdown"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Generic machine emulator and virtualizer
brew "qemu"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# SOcket CAT: netcat on steroids
brew "socat"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Cross-shell prompt for astronauts
brew "starship"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Feature-rich console based todo list manager
brew "task"
# Shell wrapper for Taskwarrior commands
brew "tasksh"
# Send macOS User Notifications from the command-line
brew "terminal-notifier"
# Reads from existing Cloud Providers and generates Terraform code
brew "terracognita"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# CLI tool to generate terraform files from existing infrastructure
brew "terraformer"
# Thin wrapper for Terraform e.g. for locking state
brew "terragrunt"
# Detect compliance and security violations across Infrastructure as Code
brew "terrascan"
# Linter for Terraform files
brew "tflint"
# Static analysis security scanner for your terraform code
brew "tfsec"
# Programmatically correct mistyped console commands
brew "thefuck"
# Simplified and community-driven man pages
brew "tldr"
# Command-line translator using Google Translate and more
brew "translate-shell"
# Lightweight, POSIX-compliant regular expression (regex) library
brew "tre"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extraction utility for .zip compressed archives
brew "unzip"
# Vi 'workalike' with many additional features
brew "vim"
# Tool for creating isolated virtual python environments
brew "virtualenv"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Homebrew, but with Docker images
brew "whalebrew"
# Modular BSD reimplementation of NASM
brew "yasm"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# General-purpose lossless data-compression library
brew "zlib"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Dagger is an integrated platform to orchestrate the delivery of applications
brew "dagger/tap/dagger"
# PAM module for reattaching to the user's GUI (Aqua) session
brew "fabianishere/personal/pam_reattach"
# Terraform
brew "hashicorp/tap/terraform"
# Command-line interface to JMESPath, a query language for JSON
brew "jmespath/jmespath/jp"
# Localstack cli packaged using pyinstaller
brew "localstack/tap/localstack-cli"
# Super fast CLI tool to decode and encode JWTs built in Rust
brew "mike-engel/jwt-cli/jwt-cli"
# A command line editor for HCL
brew "minamijoyo/hcledit/hcledit"
# Update version constraints in your Terraform configurations
brew "minamijoyo/tfupdate/tfupdate"
# Fast, multipurpose tool for AWS CloudWatch Logs
brew "tylerbrock/saw/saw"
# Enable Windows-like alt-tab
cask "alt-tab"
# User-friendly GUI app for Homebrew
cask "applite"
# App to build and share containerised applications and microservices
cask "docker"
# Network scanner
cask "fing"
cask "font-hack-nerd-font"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Password manager app
cask "keepassxc"
# Open-source keystroke visualiser
cask "keycastr"
# Cloud credentials manager
cask "leapp"
cask "marmaduke-chromium"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Web browser
cask "opera"
# Collaboration platform for API development
cask "postman"
# Flexible software sketchbook and a language for learning how to code
cask "processing"
# Productivity tool to launch everything
cask "spotter"
# System monitor for the menu bar
cask "stats"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin"
# Developer experience toolkit used to check, test, merge, and monitor code
cask "trunk-io"
# Multimedia player
cask "vlc"
# Native desktop client for WhatsApp
cask "whatsapp"
# Multiplayer code editor
cask "zed"
# Video communication and virtual meeting platform
cask "zoom"
mas "Boop", id: 1518425043
mas "FTP Rush", id: 1611675603
mas "Keynote", id: 409183694
mas "WeatherDock", id: 1624480719
mas "Xcode", id: 497799835
{{ if eq .enable.lang.rust true -}}
vscode "1yib.rust-bundle"
{{ end -}}
vscode "42crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "adib.simple-markdown-coverter"
vscode "adpyke.vscode-sql-formatter"
vscode "alexcvzz.vscode-sqlite"
vscode "alexkrechik.cucumberautocomplete"
vscode "amazonwebservices.amazon-q-vscode"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "antfu.file-nesting"
vscode "arcanis.vscode-zipfs"
vscode "awesomektvn.scratchpad"
vscode "azeemba.python-ast-preview"
vscode "bbenoist.nix"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-mermaid"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "bradymholt.pgformatter"
vscode "buianhthang.xml2json"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "chrmarti.regex"
vscode "codezombiech.gitignore"
vscode "cymonk.sql-formatter"
vscode "danielsanmedium.dscodegpt"
vscode "danwhitfield.sparql-executor"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "ddot.vscode-ast"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "donjayamanne.python-environment-manager"
vscode "donjayamanne.python-extension-pack"
vscode "dotjoshjohnson.xml"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "eastman.vscode-cfn-nag"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "felixfbecker.php-intellisense"
vscode "firsttris.vscode-jest-runner"
vscode "folke.vscode-monorepo-workspace"
vscode "formulahendry.code-runner"
vscode "georgewfraser.vscode-javac"
vscode "ginfuru.ginfuru-better-solarized-dark-theme"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "gitlab.gitlab-workflow"
{{ if eq .enable.lang.golang true -}}
vscode "golang.go"
{{ end -}}
vscode "google.wireit"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.global-config"
vscode "hashicorp.terraform"
vscode "hediet.debug-visualizer"
vscode "hediet.vscode-drawio"
vscode "herrmannplatz.npm-dependency-links"
vscode "ibm.output-colorizer"
vscode "inferrinizzard.prettier-sql-vscode"
vscode "ivory-lab.jenkinsfile-support"
vscode "janjoerke.jenkins-pipeline-linter-connector"
vscode "jasonnutter.search-node-modules"
vscode "jebbs.plantuml"
vscode "jinhyuk.replace-curly-quotes"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "k--kato.intellij-idea-keybindings"
vscode "kddejong.vscode-cfn-lint"
vscode "kevinrose.vsc-python-indent"
vscode "kisstkondoros.vscode-codemetrics"
vscode "lehni.vscode-fix-checksums"
vscode "leodevbro.blockman"
vscode "lextudio.restructuredtext"
vscode "mariusschulz.yarn-lock-syntax"
vscode "marlon407.code-groovy"
vscode "matthewevers.compiler-explorer"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "monada.vscode-wing"
vscode "moonrepo.moon-console"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-playwright.playwright"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.flake8"
vscode "ms-python.isort"
vscode "ms-python.pylint"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.remote-wsl-recommender"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "msjsdiag.vscode-react-native"
vscode "mtxr.sqltools"
vscode "naumovs.color-highlight"
vscode "nicolasvuillamy.vscode-groovy-lint"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "nrwl.angular-console"
vscode "oderwat.indent-rainbow"
vscode "pflannery.vscode-versionlens"
vscode "quicktype.quicktype"
vscode "qwtel.sqlite-viewer"
vscode "randomfractalsinc.vscode-data-preview"
vscode "rangav.vscode-thunder-client"
vscode "rdfox.rdfox-rdf"
vscode "redhat.fabric8-analytics"
vscode "redhat.java"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "robbowen.synthwave-vscode"
vscode "romanpeshkov.go-test-outline"
vscode "rome.rome"
{{ if eq .enable.lang.rust true -}}
vscode "rust-lang.rust-analyzer"
{{ end -}}
vscode "ryanluker.vscode-coverage-gutters"
vscode "samuelcolvin.jinjahtml"
vscode "scala-lang.scala"
vscode "serayuzgur.crates"
vscode "skellock.just"
vscode "snyk-security.snyk-vulnerability-scanner"
vscode "sodatea.velocity"
vscode "sonarsource.sonarlint-vscode"
vscode "sourcegraph.openctx"
vscode "spmeesseman.vscode-taskexplorer"
vscode "statelyai.stately-vscode"
vscode "swellaby.workspace-config-plus"
vscode "tabbyml.vscode-tabby"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "tkcandrade.code-annotation"
vscode "tkrkt.linenote"
vscode "tomoki1207.pdf"
vscode "trond-snekvik.simple-rst"
vscode "trunk.io"
vscode "tushortz.python-extended-snippets"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-icons-team.vscode-icons"
vscode "whatwedo.twig"
vscode "wholroyd.jinja"
vscode "wmaurer.change-case"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
